ChartsOfCalculationTypes/ВидыНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<ChartOfCalculationTypes>
		<Properties>
			<Name>ВидыНачислений</Name>
			<BaseCalculationTypes>
				<xr:Item>ChartOfCalculationTypes.ВидыНачислений</xr:Item>
			</BaseCalculationTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетОтОбратного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачетОтработанногоВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйДоход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяРасчетБазы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяРасчетВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяРасчетВремениВЧасах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОблагаетсяПН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОблагаетсяСФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОблагаетсяПрофВзнос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчетаСреднегоЗаработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCalculationTypes>
</MetaDataObject>

Enums/СпособыРасчетаНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>СпособыРасчетаНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоМесячнойСтавкеПоДням</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДневнойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнойСуммой</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоМесячнойСтавкеПоЧасам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЧасовойСтавке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботаСверхурочно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГодоваяПремия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольнаяФормула</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КатегорииРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>КатегорииРасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Первичное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗависимоеПервогоУровня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗависимоеВторогоУровня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗависимоеТретьегоУровня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗависимоеЧетвертогоУровня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗависимоеПятогоУровня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗависимоеШестогоУровня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗависимоеСедьмогоУровня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗависимоеВосьмогоУровня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗависимоеДевятогоУровня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗависимоеДесятогоУровня</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ChartsOfCalculationTypes/ВидыНачислений/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Учет перерасчетов не ведется.
	Если ВедущиеВидыРасчета.Количество() > 0 Тогда 
		ВедущиеВидыРасчета.Очистить();
	КонецЕсли;	
	
	// Определение базовых и ведущих
	Если СпособРасчета = Перечисления.СпособыРасчетаНачислений.ПоДневнойСтавке
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.ПоМесячнойСтавкеПоДням
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.ПоМесячнойСтавкеПоЧасам
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.ПоЧасовойСтавке 
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.РаботаСверхурочно
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.Неявка
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.ФиксированнойСуммой Тогда
		
		БазовыеВидыРасчета.Очистить();
	КонецЕсли;
	
	Если СпособРасчета = Перечисления.СпособыРасчетаНачислений.ОплатаБольничного
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.ОплатаОтпуска
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.Неявка
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.ФиксированнойСуммой Тогда 
		ВытесняющиеВидыРасчета.Очистить();
	КонецЕсли;	
	
	// Определение ТребуетсяРасчетБазы 
	ТребуетсяРасчетБазы = НЕ БазовыеВидыРасчета.Количество() = 0;
	
	// Определение ТребуетсяРасчетВремени 
	ТребуетсяРасчетВремени = Ложь;
	Если СпособРасчета = Перечисления.СпособыРасчетаНачислений.ПоДневнойСтавке
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.ПоМесячнойСтавкеПоДням
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.ПоМесячнойСтавкеПоЧасам
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.ПоЧасовойСтавке
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.ПоМесячнойСтавкеОтОбратногоПоДням
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.РаботаСверхурочно Тогда 		
		ТребуетсяРасчетВремени = Истина;
	КонецЕсли;	
	
	// Определение для ПроизвольнаяФормула
	Если СпособРасчета = Перечисления.СпособыРасчетаНачислений.ПроизвольнаяФормула Тогда 
		Если СтрНайти(Формула, "НормаДней") > 0
			Или СтрНайти(Формула, "НормаЧасов") > 0
			Или СтрНайти(Формула, "ФактДней") > 0
			Или СтрНайти(Формула, "ФактЧасов") > 0 Тогда 
			
			ТребуетсяРасчетВремени = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	// Определение Категории
	Если КатегорияРасчета.Пустая() Тогда 
		КатегорияРасчета = Перечисления.КатегорииРасчетов.Первичное;
	КонецЕсли;	
	
	Если БазовыеВидыРасчета.Количество() = 0 Тогда 
		КатегорияРасчета = Перечисления.КатегорииРасчетов.Первичное;
	Иначе 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МАКСИМУМ(ВидыНачисленийБазовыеВидыРасчета.ВидРасчета.КатегорияРасчета) КАК КатегорияРасчета
			|ПОМЕСТИТЬ ВременнаяТаблицаКатегорияРасчетаМАКСИМУМ
			|ИЗ
			|	ПланВидовРасчета.ВидыНачислений.БазовыеВидыРасчета КАК ВидыНачисленийБазовыеВидыРасчета
			|ГДЕ
			|	ВидыНачисленийБазовыеВидыРасчета.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВЫБОР
			|		КОГДА ВременнаяТаблица.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.Первичное)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеПервогоУровня)
			|		КОГДА ВременнаяТаблица.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеПервогоУровня)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеВторогоУровня)
			|		КОГДА ВременнаяТаблица.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеВторогоУровня)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеТретьегоУровня)
			|		КОГДА ВременнаяТаблица.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеТретьегоУровня)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеЧетвертогоУровня)
			|		КОГДА ВременнаяТаблица.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеЧетвертогоУровня)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеПятогоУровня)
			|		КОГДА ВременнаяТаблица.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеПятогоУровня)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеШестогоУровня)
			|		КОГДА ВременнаяТаблица.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеШестогоУровня)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеСедьмогоУровня)
			|		КОГДА ВременнаяТаблица.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеСедьмогоУровня)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеВосьмогоУровня)
			|		КОГДА ВременнаяТаблица.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеВосьмогоУровня)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеДевятогоУровня)
			|		КОГДА ВременнаяТаблица.КатегорияРасчета = ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеДевятогоУровня)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.ЗависимоеДесятогоУровня)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.КатегорииРасчетов.Первичное)
			|	КОНЕЦ КАК КатегорияРасчета
			|ИЗ
			|	ВременнаяТаблицаКатегорияРасчетаМАКСИМУМ КАК ВременнаяТаблица";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		КатегорияРасчета = ВыборкаДетальныеЗаписи.КатегорияРасчета;
	КонецЕсли;	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если СпособРасчета = Перечисления.СпособыРасчетаНачислений.Процентом
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.ГодоваяПремия
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.ОплатаБольничного
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.ОплатаОтпуска Тогда 
		
		ПроверяемыеРеквизиты.Добавить("БазовыеВидыРасчета");		
	КонецЕсли;
	
	Если НЕ (СпособРасчета = Перечисления.СпособыРасчетаНачислений.ОплатаОтпуска
		Или СпособРасчета = Перечисления.СпособыРасчетаНачислений.ОплатаБольничного) Тогда 
		
		БухгалтерскийУчетСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ПериодРасчетаСреднегоЗаработка");
	КонецЕсли;	
	
	Если СпособРасчета = Перечисления.СпособыРасчетаНачислений.ГодоваяПремия Тогда 
		ПроверяемыеРеквизиты.Добавить("Доля");		
	КонецЕсли;	
	
	Если СпособРасчета = Перечисления.СпособыРасчетаНачислений.РаботаСверхурочно Тогда 
		ПроверяемыеРеквизиты.Добавить("Коэффициент");		
	КонецЕсли;	
	
	Если СпособРасчета = Перечисления.СпособыРасчетаНачислений.ПроизвольнаяФормула Тогда
		БазовыеВидыРасчета.Очистить();
		КонтрольФормулы(Отказ);		
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Контроль корректности формулы
//
Процедура КонтрольФормулы(Отказ)

	ФормулаДляКонтроля = Формула;

	МассивКонтрольВидовРасчетов = Новый Массив;
	
	ФормулаДляКонтроля = СтрЗаменить(ФормулаДляКонтроля, "[НормаДней]", 1);
	ФормулаДляКонтроля = СтрЗаменить(ФормулаДляКонтроля, "[НормаЧасов]", 1);
	ФормулаДляКонтроля = СтрЗаменить(ФормулаДляКонтроля, "[ФактДней]", 1);
	ФормулаДляКонтроля = СтрЗаменить(ФормулаДляКонтроля, "[ФактЧасов]", 1);
	ФормулаДляКонтроля = СтрЗаменить(ФормулаДляКонтроля, "[Размер]", 1);
	
	Пока Найти(ФормулаДляКонтроля, "[") > 0
		И Найти(ФормулаДляКонтроля, "]") > 0 Цикл 
		
		Позиция1 = Найти(ФормулаДляКонтроля, "[");
		Позиция2 = Найти(ФормулаДляКонтроля, "]") + 1;
		
		НаименованиеВидаРасчета = Сред(ФормулаДляКонтроля, Позиция1, Позиция2 - Позиция1);
		ФормулаДляКонтроля = СтрЗаменить(ФормулаДляКонтроля, НаименованиеВидаРасчета, 1);
		
		НаименованиеВидаРасчета = СтрЗаменить(НаименованиеВидаРасчета, "[", "");
		НаименованиеВидаРасчета = СтрЗаменить(НаименованиеВидаРасчета, "]", "");

		МассивКонтрольВидовРасчетов.Добавить(НаименованиеВидаРасчета);
	КонецЦикла;	
	
	Для Каждого ЭлментМассиваВидРасчета Из МассивКонтрольВидовРасчетов Цикл 
		ВидРасчетаСсылка = ПланыВидовРасчета.ВидыНачислений.НайтиПоНаименованию(ЭлментМассиваВидРасчета, Истина);
		
		Если НЕ ЗначениеЗаполнено(ВидРасчетаСсылка) Тогда 
			ТекстСообщения = НСтр("ru = 'Не верно указан вид расчета ""%НаименованиеВидаРасчета%""!'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НаименованиеВидаРасчета%", НаименованиеВидаРасчета);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Иначе 
			СтрокаТаблицы = БазовыеВидыРасчета.Добавить();
			СтрокаТаблицы.ВидРасчета = ВидРасчетаСсылка;                   
		КонецЕсли;	
	КонецЦикла;	
	
	ФормулаДляКонтроля = СтрЗаменить(ФормулаДляКонтроля, " ", "");
	МассивСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ФормулаДляКонтроля, "+-*/()");
	
	Для Каждого ЭлементМассиваСлово Из МассивСлов Цикл
		Попытка
			Сумма = Вычислить("1+" + ЭлементМассиваСлово);
		Исключение
			ТекстСообщения = НСтр("ru = 'Не верное выражение ""%Слово%""!'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Слово%", ЭлементМассиваСлово);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецПопытки;
	КонецЦикла;	

	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	// Попытка расчета по формуле.
	Попытка
		Сумма = Вычислить(ФормулаДляКонтроля);
	Исключение
	    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(),,,,Отказ);
	КонецПопытки;		
КонецПроцедуры // КонтрольФормулы()

#КонецОбласти

#КонецЕсли
